//========================================
// 
// テクスチャ管理
// 
//========================================
// *** texture.h ***
//========================================
#ifndef _TEXTURE_H_	//このマクロ定義がされてなかったら
#define _TEXTURE_H_	//２重インクルード防止のマクロ定義

//==================================================
// インクルード
//==================================================
#include "main.h"

//==================================================
// 定義
//==================================================
class CTexture
{
public:

	// ***** 定義 *****
	static const int MAX_TEXTURE = 50;	// テクスチャの最大数
	static const char* FILE_PATH;		// ファイルパス

	// ***** 関数 *****
	CTexture();		// デフォルトコンストラクタ
	~CTexture();	// デストラクタ

	HRESULT Load(void);			// 読み込み
	void Unload(void);			// 破棄

private:
	// ***** 変数 *****
	static int m_nTextureAll;								// テクスチャの総数
	static char s_FileName[MAX_TEXTURE][TXT_MAX];			// ファイルパス
};

#endif // !_TEXTURE_H_
